"Сеньор Муркерио"
'Сеньор Муркерио'
str("Сеньор Муркерио")

# Сложение строк
print("Сеньор Муркерио" + " " + 'Сеньор Муркерио')

print((6 + 6.8 - 222) / 4 * 892)

print(0.1 + 0.2)
print(round(0.1 + 0.2, 4))

#i = input()
#i = int(i)
#print(f"Сеньор Муркерио номер {i}")

name = "Сеньор Муркерио"
outdoor_celsius = 5
print(f"{name} пошел на прогулку")

if outdoor_celsius < 10:
    print("Мама говорит: надень шапку. Послушался")
elif outdoor_celsius < 25:
    print("Погода отличная. Мех греет")
else:
    print("Сегодня жарковато")