# создала коробочку с именем vector1_str 
# и положила туда разрезанный на куски текст (список)
vector1_str = input().split()
vector2_str = input().split()
# .input() — просит пользователя ввести текст. 
# .split() — рубит этот текст на куски по пробелам. 
# Результат: если ввели "1.0 2.0 3.0", получится список ["1.0", "2.0", "3.0"]

# Превращаем строки в числа с плавающей точкой (float)
# "Возьми то, что лежит 
# в коробочке vector1_str, преврати это в числа и распредели по коробкам x1, y1, z1
x1, y1, z1 = map(float, vector1_str)
x2, y2, z2 = map(float, vector2_str)

# Считаем скалярное произведение
result = (x1 * x2) + (y1 * y2) + (z1 * z2)

# Выводим результат
print(result)
